app/helpers/sessions_helper.rb

    def current_user
        if  @current_user.nil?
            @current_user = User.find_by(id: session[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]