app/controllers/mades_controller.rb

  def index
    @mades = Made.all
---
SELECT "mades".* FROM "mades"

  def create
    @made = Made.new(made_params)
    @made.image.attach(params[:made][:image])

    respond_to do |format|
      if @made.save
---
INSERT INTO "mades" ("content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "Pink tule dress. Made in 2019"], ["user_id", 1], ["created_at", "2020-12-11 18:32:45.238458"], ["updated_at", "2020-12-11 18:32:45.238458"]]

  def update
    respond_to do |format|
      if @made.update(made_params)
---
UPDATE "mades" SET "updated_at" = ? WHERE "mades"."id" = ?  [["updated_at", "2020-12-11 18:32:45.322745"], ["id", 1]]

    def set_made
      @made = Made.find(params[:id])
---
SELECT "mades".* FROM "mades" WHERE "mades"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]