app/controllers/messages_controller.rb

SELECT "users".* FROM "users"
---
  def new
    @options = {}
    user = User.all
    if user
      user.each do |u|

INSERT INTO "messages" ("content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "hi"], ["user_id", 1], ["created_at", "2020-12-11 16:16:14.473097"], ["updated_at", "2020-12-11 16:16:14.473097"]]
INSERT INTO "messages" ("content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "Hi! I was hoping you could recreate this dope bag for me??"], ["user_id", 3], ["created_at", "2020-12-11 20:49:18.364621"], ["updated_at", "2020-12-11 20:49:18.364621"]]
---
  def create
    @message = Message.new(message_params)
    @message.image.attach(params[:message][:image])
    respond_to do |format|
      if @message.save