app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def correct_user
      #find the user who’s id is submitted
      @user = User.find(params[:id])